; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v1 ?v6)
             (pred_8 ?v2 ?v5)
             (pred_7 ?v1 ?v5)
             (pred_12 ?v9 ?v1 )
	     (pred_10 ?v1)
             (pred_9 ?v8)
             (pred_2 ?v2)
             (pred_3 ?v5)
             (pred_1 ?v1)
             (pred_6 ?v2)
             (pred_5 ?v1)
             (pred_4 ))



(:action op_1
:parameters (?v4 ?v11 ?v3 ?v12)
:precondition (and (pred_9 ?v4) (pred_9 ?v11) (pred_2 ?v3) (pred_3 ?v12)
          (pred_11 ?v4 ?v11) (pred_8 ?v3 ?v12)
                   (pred_7 ?v11 ?v12) (pred_10 ?v4) 
                   (pred_1 ?v11) (pred_6 ?v3))
:effect (and  (pred_5 ?v11) (not (pred_1 ?v11))))


(:action op_3
:parameters (?v4 ?v7)
:precondition (and (pred_9 ?v4) (pred_9 ?v7)
               (pred_10 ?v4) (pred_11 ?v4 ?v7) (pred_5 ?v7))
:effect (and (pred_10 ?v7) (not (pred_10 ?v4))))

(:action op_4
:parameters (?v4 ?v3)
:precondition (and (pred_9 ?v4) (pred_2 ?v3) 
                  (pred_10 ?v4) (pred_12 ?v3 ?v4) (pred_4 ))
:effect (and (pred_6 ?v3)
   (not (pred_12 ?v3 ?v4)) (not (pred_4 ))))


(:action op_2
:parameters (?v4 ?v13 ?v10)
:precondition (and (pred_9 ?v4) (pred_2 ?v13) (pred_2 ?v10)
                  (pred_10 ?v4) (pred_6 ?v10) (pred_12 ?v13 ?v4))
:effect (and (pred_6 ?v13) (pred_12 ?v10 ?v4)
        (not (pred_6 ?v10)) (not (pred_12 ?v13 ?v4))))

(:action op_5
:parameters (?v4 ?v3)
:precondition (and (pred_9 ?v4) (pred_2 ?v3) 
                  (pred_10 ?v4) (pred_6 ?v3))
:effect (and (pred_4 ) (pred_12 ?v3 ?v4) (not (pred_6 ?v3)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_08 obj_10 obj_06 obj_03 obj_07 obj_04 obj_01 obj_11
    obj_13 obj_12
    obj_02 obj_09
    )

    (:init
       (pred_4)

       (pred_9 obj_05)
       (pred_9 obj_08)
       (pred_9 obj_10)
       (pred_9 obj_06)
       (pred_9 obj_03)
       (pred_9 obj_07)
       (pred_9 obj_04)
       (pred_9 obj_01)
       (pred_9 obj_11)
       (pred_3 obj_13)
       (pred_3 obj_12)
       (pred_2 obj_02)
       (pred_2 obj_09)

       (pred_11 obj_05 obj_06)
       (pred_11 obj_05 obj_08)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_08 obj_10)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_10 obj_07)
       (pred_11 obj_10 obj_08)
       (pred_11 obj_06 obj_04)
       (pred_11 obj_06 obj_03)
       (pred_11 obj_06 obj_05)
       (pred_11 obj_03 obj_01)
       (pred_11 obj_03 obj_07)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_03 obj_06)
       (pred_11 obj_07 obj_11)
       (pred_11 obj_07 obj_10)
       (pred_11 obj_07 obj_03)
       (pred_11 obj_04 obj_01)
       (pred_11 obj_04 obj_06)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_01 obj_03)
       (pred_11 obj_01 obj_04)
       (pred_11 obj_11 obj_07)
       (pred_11 obj_11 obj_01)
       (pred_1 obj_04)
       (pred_1 obj_11)
       (pred_7  obj_04 obj_13)
       (pred_7  obj_11 obj_12)
       (pred_5 obj_05)
       (pred_5 obj_08)
       (pred_5 obj_10)
       (pred_5 obj_06)
       (pred_5 obj_03)
       (pred_5 obj_07)
       (pred_5 obj_01)

       (pred_8  obj_02 obj_13)
       (pred_8  obj_09 obj_12)
       (pred_12 obj_02 obj_10)
       (pred_12 obj_09 obj_10)
       (pred_10 obj_06)
    )

    (:goal (and
       (pred_12 obj_09 obj_06)
    ))
(:constraints
  (always (not (pred_10 obj_08)))
)
)

; plan
1. (op_3 obj_06 obj_03)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_03)
   goals met: 0 of 1
2. (op_3 obj_03 obj_07)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_07)
   goals met: 0 of 1
3. (op_3 obj_07 obj_10)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_10)
   goals met: 0 of 1
4. (op_4 obj_10 obj_09)
   deleted: (pred_12 obj_09 obj_10) (pred_4)
   added: (pred_6 obj_09)
   goals met: 0 of 1
5. (op_3 obj_10 obj_07)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_07)
   goals met: 0 of 1
6. (op_3 obj_07 obj_03)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_03)
   goals met: 0 of 1
7. (op_3 obj_03 obj_06)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_06)
   goals met: 0 of 1
8. (op_5 obj_06 obj_09)
   deleted: (pred_6 obj_09)
   added: (pred_4) (pred_12 obj_09 obj_06)
   goals met: 1 of 1
